[
	"The history of all hitherto existing society\nis the history of class struggles.\nFreeman and slave, patrician and plebeian, lord and serf, guild-master\nand journeyman, in a\nword, oppressor and oppressed, stood in constant opposition to one another, carried on an\nuninterrupted, now hidden, now open fight, a fight that each time ended, either in a revolutionary\nreconstitution of society at large, or in the common ruin of the contending classes.\nIn the earlier epochs of history, we find almost everywhere a complicated arrangement of society\ninto various orders, a manifold gradation of social rank. In ancient Rome we have patricians,\nknights, plebeians, slaves; in the Middle Ages, feudal lords, vassals, guild-masters, journeymen,\napprentices, serfs; in almost all of these classes, again, subordinate gradations.\nThe modern bourgeois society that has sprouted from the ruins of feudal society has not done\naway with class antagonisms. It has but established new classes, new conditions of oppression,\nnew forms of struggle in place of the old ones.\nOur epoch, the epoch of the bourgeoisie, possesses, however, this distinct feature: it has\nsimplified class antagonisms. Society as a whole is more and more splitting up into two great\nhostile camps, into two great classes directly facing each other – Bourgeoisie and Proletariat.\nFrom the serfs of the Middle Ages sprang the chartered burghers of the earliest towns. From these\nburgesses the first elements of the bourgeoisie were developed.\nThe discovery of America, the rounding of the Cape, opened up fresh ground for the rising\nbourgeoisie.",
	"The East-Indian and Chinese markets, the colonisation of America, trade with the\ncolonies, the increase in the means of exchange and in commodities generally, gave to commerce,\nto navigation, to industry, an impulse never before known, and thereby, to the revolutionary\nelement in the tottering feudal society, a rapid development.\nThe feudal system of industry, in which industrial production was monopolised by closed guilds,\nnow no longer sufficed for the growing wants of the new markets. The manufacturing system\ntook its place. The guild-masters were pushed on one side by the manufacturing middle class;\ndivision of labour between the different corporate guilds vanished in the face of division of labour\nin each single workshop.\nMeantime the markets kept ever growing, the demand ever rising. Even manufacturer no longer\nsufficed. Thereupon, steam and machinery revolutionised industrial production. The place of\nmanufacture was taken by the giant, Modern Industry; the place of the industrial middle class by\nindustrial millionaires, the leaders of the whole industrial armies, the modern bourgeois.\nModern industry has established the world market, for which the discovery of America paved the\nway. This market has given an immense development to commerce, to navigation, to\ncommunication by land. This development has, in its turn, reacted on the extension of industry;\nand in proportion as industry, commerce, navigation, railways extended, in the same proportion\nthe bourgeoisie developed, increased its capital, and pushed into the background every class\nhanded down from the Middle Ages.\nWe see, therefore, how the modern bourgeoisie is itself the product of a long course of\ndevelopment, of a series of revolutions in the modes of production and of exchange.",
	"Each step in the development of the bourgeoisie was accompanied by a corresponding political\nadvance of that class. An oppressed class under the sway of the feudal nobility, an armed and\nself-governing association in the medieval commune\n: here independent urban republic (as in\nItaly and Germany); there taxable “third estate” of the monarchy (as in France); afterwards, in the\nperiod of manufacturing proper, serving either the semi-feudal or the absolute monarchy as a\ncounterpoise against the nobility, and, in fact, cornerstone of the great monarchies in general, the\nbourgeoisie has at last, since the establishment of Modern Industry and of the world market,\nconquered for itself, in the modern representative State, exclusive political sway. The executive\nof the modern state is but a committee for managing the common affairs of the whole\nbourgeoisie.\nThe bourgeoisie, historically, has played a most revolutionary part.\nThe bourgeoisie, wherever it has got the upper hand, has put an end to all feudal, patriarchal,\nidyllic relations. It has pitilessly torn asunder the motley feudal ties that bound man to his\n“natural superiors”, and has left remaining no other nexus between man and man than naked selfinterest,\nthan callous “cash payment”. It has drowned the most heavenly ecstasies of religious\nfervour, of chivalrous enthusiasm, of philistine sentimentalism, in the icy water of egotistical\ncalculation. It has resolved personal worth into exchange value, and in place of the numberless\nindefeasible chartered freedoms, has set up that single, unconscionable freedom – Free Trade. In\none word, for exploitation, veiled by religious and political illusions, it has substituted naked,\nshameless, direct, brutal exploitation.",
	"The bourgeoisie has stripped of its halo every occupation hitherto honoured and looked up to with\nreverent awe. It has converted the physician, the lawyer, the priest, the poet, the man of science,\ninto its paid wage labourers.\nThe bourgeoisie has torn away from the family its sentimental veil, and has reduced the family\nrelation to a mere money relation.\nThe bourgeoisie has disclosed how it came to pass that the brutal display of vigour in the Middle\nAges, which reactionaries so much admire, found its fitting complement in the most slothful\nindolence. It has been the first to show what man’s activity can bring about. It has accomplished\nwonders far surpassing Egyptian pyramids, Roman aqueducts, and Gothic cathedrals; it has\nconducted expeditions that put in the shade all former Exoduses of nations and crusades.\nThe bourgeoisie cannot exist without constantly revolutionising the instruments of production,\nand thereby the relations of production, and with them the whole relations of society.\nConservation of the old modes of production in unaltered form, was, on the contrary, the first\ncondition of existence for all earlier industrial classes. Constant revolutionising of production,\nuninterrupted disturbance of all social conditions, everlasting uncertainty and agitation\ndistinguish the bourgeois epoch from all earlier ones. All fixed, fast-frozen relations, with their\ntrain of ancient and venerable prejudices and opinions, are swept away, all new-formed ones\nbecome antiquated before they can ossify. All that is solid melts into air, all that is holy is\nprofaned, and man is at last compelled to face with sober senses his real conditions of life, and his\nrelations with his kind.",
	"The need of a constantly expanding market for its products chases the bourgeoisie over the entire\nsurface of the globe. It must nestle everywhere, settle everywhere, establish connexions\neverywhere.\nThe bourgeoisie has through its exploitation of the world market given a cosmopolitan character\nto production and consumption in every country. To the great chagrin of Reactionists, it has\ndrawn from under the feet of industry the national ground on which it stood. All old-established\nnational industries have been destroyed or are daily being destroyed. They are dislodged by new\nindustries, whose introduction becomes a life and death question for all civilised nations, by\nindustries that no longer work up indigenous raw material, but raw material drawn from the\nremotest zones; industries whose products are consumed, not only at home, but in every quarter\nof the globe. In place of the old wants, satisfied by the production of the country, we find new\nwants, requiring for their satisfaction the products of distant lands and climes. In place of the old\nlocal and national seclusion and self-sufficiency, we have intercourse in every direction, universal\ninter-dependence of nations. And as in material, so also in intellectual production. The intellectual\ncreations of individual nations become common property. National one-sidedness and narrowmindedness\nbecome more and more impossible, and from the numerous national and local\nliteratures, there arises a world literature.\nThe bourgeoisie, by the rapid improvement of all instruments of production, by the immensely\nfacilitated means of communication, draws all, even the most barbarian, nations into civilisation.\nThe cheap prices of commodities are the heavy artillery with which it batters down all Chinese\nwalls, with which it forces the barbarians’ intensely obstinate hatred of foreigners to capitulate. It\ncompels all nations, on pain of extinction, to adopt the bourgeois mode of production."
]
